# --- General & Productivity ---
mechatroner.rainbow-csv
shinyypig.md-paste-image
tomoki1207.pdf

# --- Python & Data Science ---
ms-python.python
ms-python.debugpy
ms-python.vscode-pylance
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow

# --- Docker & Remote Development ---
ms-azuretools.vscode-docker
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-wsl

# --- LaTeX ---
# 'James-Yu.latex-workshop' is the current standard for LaTeX in VS Code.
James-Yu.latex-workshop
# mathematic.vscode-latex

# --- Potentially invalid entries from original list ---
# The following extension ID appears to be a typo or does not exist.
# continue.continue